var data = [
  {
    "type": "歷史古蹟",
    "area": "豐原區",
    "介紹": "「頂街派出所」為RC 二層樓建築，其正立面兩邊並不對稱菱形窗，二樓則有牛眼窗。由於具有特色，由原台中縣政府於2002 年公告為歷史建築。地點位於現今豐原火車站旁，建築興築於日治時期1930年代，日治時期亦是警察駐在所，建築構造為RC加強磚造，立面凸起水平線條裝飾，呈現表現主義風格，建築左右立面並不對稱，入口左右各有一菱形窗，二樓側立面則有牛眼窗，左右各三個，對稱排列。建築原為褐色洗石子外牆，牆基貼飾綠釉溝紋面磚，因警察局使用需要而噴漆成紅色，於民國91年4月16日公告登錄為歷史建築。",
    "停車資訊": "",
    "北緯": "24.25367",
    "name": "頂街派出所",
    "address": "台中市豐原區中正路5號",
    "大眾運輸": "",
    "旅遊叮嚀": "",
    "景點ID": "1392",
    "東經": "120.72259",
    "狀態": "開啟",
    "簡述": "「頂街派出所」位於豐原區中正路5 號（豐原火車站旁），建於日治時代1930 年，原為台中州豐原郡頂街警察官吏派出所，民國91 年縣政府將其登錄為歷史建築。",
    "行車資訊": "",
    "門票資訊": "免費參觀",
    "tel": "無",
    "picture": "https://www.tchac.taichung.gov.tw/uploads/tchac/images/large/387c6047-5dd2-4bec-a3e0-fa0ce876149e.jpg",
    "開放時間": " 僅開放外部及周遭範圍参觀，暫無開放入內參觀。",
    "官方網站": "https://www.tchac.taichung.gov.tw/historybuilding?uid=34&pid=34"
  },

  {
    "type": "藝文走廊",
    "area": "豐原區",
    "介紹": "全台首創迷你CNC雕刻體驗教室，共30台機器體驗mini CNC玩創作，體驗與眾不同，有別於一般手作課程，輕巧的機器外型搭配數位雕刻功能，初學者也能快速上手，在體驗的過程中不但獲得樂趣並激發創造力，每人一機親手操作製作自己的專屬小物，也是最特別的心意禮物。「小學堂老少咸宜，是很好的文創產業，也可以捐獻弱勢團體，培植善因好緣。」陳宜利述說成立創意小學堂的緣起：寒暑假時，偶而會帶小孩到公司上班，發現孩子會使用機器及軟體的創意，並隨心所欲製作各項成品。此外也因與歐洲客戶合作，見到歐洲國家讓孩童使用迷你工具機，自己動手做的精神很令人讚嘆。因此毅然決定將此理念在台灣推廣。",
    "停車資訊": "",
    "北緯": "24.2521",
    "name": "Sylvia創意小學堂",
    "address": "台中市豐原區北陽路8號2樓",
    "大眾運輸": "",
    "旅遊叮嚀": "",
    "景點ID": "1391",
    "東經": "120.72969",
    "狀態": "開啟",
    "簡述": "臺中豐原SYLVIA 創意小學堂，於2014 年11 月開幕；創意小學堂是一處利用雕刻機發展各式商品、以及提供客製化商品的展售空間，也設有親子DIY 教室，可打造獨一無二屬於自己創作的成品。",
    "行車資訊": "",
    "門票資訊": "免費參觀",
    "tel": "04-25228312",
    "picture": "https://www.taichung.travel/Utility/DisplayImage?id=26493",
    "開放時間": "周一至周六10:00–18:00，週日休息",
    "官方網站": "https://cms.niceday.tw/nrysylvia/"
  },
  {
    "type": "美食天地",
    "area": "豐原區",
    "介紹": "不管是開車或騎腳踏車，由國道四號豐原端往豐原方向走，沒多久在左手邊就會有具高達三公尺的巨大餅模造型招牌映入眼簾，這裡就是製造讓老饕們一再垂涎美味糕點的「宝泉食品」豐原新廠，也是提供DIY 日式甜點的『宝泉 甘味手造所』所在。明亮乾淨又寬敞的手作體驗教室現場師傅的教學，體驗製作色彩繽粉的翻糖蛋糕，搭配各式可愛造型，療癒十足！",
    "停車資訊": "",
    "北緯": "24.2583",
    "name": "寶泉甘味手造所",
    "address": "台中市豐原區豐勢路一段468號",
    "大眾運輸": "",
    "旅遊叮嚀": "",
    "景點ID": "1390",
    "東經": "120.73205",
    "狀態": "開啟",
    "簡述": "臺中東豐旅遊線上有個觀光休憩的新景點『宝泉甘味手造所』，它是由百年的老品牌「宝泉食品」成立的豐原第一家糕餅DIY 工廠，也是國道四號豐原端的免費奉茶站，亦提供下午茶、伴手禮、四大天王麵包及日式甜點DIY 體驗服務。",
    "行車資訊": "",
    "門票資訊": "免費參觀",
    "tel": "04-25131390",
    "picture": "https://blog.cutebox.org/wp-content/uploads/2016/09/FB-5.jpg",
    "開放時間": "每日08:00–20:00",
    "官方網站": "https://paochuan.com.tw/"
  },
  {
    "type": "藝文走廊",
    "area": "豐原區",
    "介紹": "木藝人才出現嚴重斷層，有鑑於此，2014 年北科大在豐原成立「豐園北科大木創中心」 (簡稱木創中心)，緊密結合豐原木材加工、木工機械、漆藝三項產業特色，再度肩負起北科大的歷史使命，期許木藝產業傳承手工技藝、扎根工業技術、發展先進科技，讓豐原具有百年木藝歷史所建構的木藝產業鏈活絡再起，重現臺灣木藝產業榮景。本中心根據成立宗旨，「豐園北科大木創中心」座落於台中市豐原區豐勢路一段551 號，聳立三支煙囪是豐園聚落的地標，其主要任務有六： (一)協助創意設計進行工程檢討、小量生產與展示推廣。 (二)舉辦「木藝文創設計實習營」，讓參與者的創意設計與木藝產業鏈接軌。(三)建置木藝工坊空間，提供微型創新創業的基地。(四)配合木藝相關產業需求，技職再造培育優質人才。(五)整合產官學資源研發新技術，強化木藝產業競爭優勢。(六)提升木工機械性能，研製優質木工機械。",
    "停車資訊": "",
    "北緯": "24.25961",
    "name": "豐園北科大木創中心",
    "address": "台中市豐原區豐勢路一段551號",
    "大眾運輸": "",
    "旅遊叮嚀": "",
    "景點ID": "1389",
    "東經": "120.73355",
    "狀態": "開啟",
    "簡述": "近年來，年輕人的概念設計在國際舞台上發光發亮，多元文化與創意優勢已台灣未來國際競爭的重要軟實力，而「木藝文創」應該在木工技藝的土壤裡孕育，才能茁壯、開花、結果，「木藝文創產業」得以生生不息永續發展。",
    "行車資訊": "",
    "門票資訊": "免費參觀",
    "tel": "04-25132677",
    "picture": "http://cowtai.com/images/train/20180811_2.jpg",
    "開放時間": "每日08:00–20:00",
    "官方網站": "http://cowtai.com/"
  },
  {
    "type": "美食天地",
    "area": "豐原區",
    "介紹": "八方國際商城是一個綜合的休閒美食廣場，是一個新型態的觀光夜市。結合食、衣及各種人文休閒育樂，亦可結合公益慈善相關社福工作，希望能帶給豐原地區的繁榮帶來不一樣的契機，商城屬豐原區唯一創意主題商場，網羅百貨及台灣獨有的夜市文化風格，滿足消費者一次購足之便利性，是一個用餐、購物、休閒的好去處。",
    "停車資訊": "",
    "北緯": "24.24539",
    "name": "八方國際觀光夜市",
    "address": "台中市豐原區豐原大道一段165號",
    "大眾運輸": "於『豐原客運總站』或『中正路上站牌』搭乘12號公車，直至『豐原大道一心路口』下車",
    "旅遊叮嚀": "",
    "景點ID": "968",
    "東經": "120.70386",
    "狀態": "開啟",
    "簡述": "八方國際商城是一個綜合的休閒美食廣場，是一個新型態的觀光夜市。",
    "行車資訊": "自行開車前往 (台中市豐原區豐原大道一段165號)，一心路上、全家便利超商對面附有免費平面停車場",
    "門票資訊": "免費參觀",
    "tel": "04-25238367",
    "picture": "https://shotrip.com/wp-content/uploads/2017/03/%E8%9E%A2%E5%B9%95%E5%BF%AB%E7%85%A7-2017-03-21-%E4%B8%8B%E5%8D%8812.42.51.png",
    "開放時間": "每週三、周五-週日17:00–00:00",
    "官方網站": "https://www.facebook.com/barfun.mall/?rf=875849052426019"
  },
  {
    "type": "美食天地",
    "area": "豐原區",
    "介紹": "「慈濟宮」廟會活動吸引眾多人潮，攤販也隨著人潮越聚越多，久而久之，便慢慢形成了夜市規模。當時的攤販大多環聚在「慈濟宮」的周圍與廣場中營業，後來「慈濟宮」利用擴建機會，將攤販予以規劃，隨後政府更將小吃街的規模擴大，召集更多餐飲業者加入經營，於是形成今日的「豐原廟東夜市」。豐原廟東夜市在網路上頗有具盛名，許多老店林立於此。這裡的三大必吃的美食有排骨麵、鳳梨冰與蚵仔煎。創業已超過30年的「清水排骨麵店」，在夜市裡招牌老、生意也最好，「清水」的取名也蠻有意思，聽說是因為該店創始人命中缺水，門口還掛著「外帶享用左邊稍候」跟「現場享用右邊稍候」讓人印象深刻。擁有70幾年歷史的「金樹鳳梨冰」，採用古法製作鳳梨冰，製作時將鳳梨與糖長時間熬煮，不加任何人工甘味的口味尤其讓人懷念。「正兆蚵仔煎」也是另一家必吃的小吃店，肥美的蚵仔搭配上空心菜、豆芽、與蔥末，最後再淋上加有花生粉的濃郁醬汁。從豐原的特產小吃到來自全省各地方的小吃，更加豐富了小吃街的口味，而廟東小吃更帶動了豐原區區的商圈。",
    "停車資訊": "豐原市立停車場。",
    "北緯": "24.25157",
    "name": "廟東夜市",
    "address": "台中市豐原區中正路167巷",
    "大眾運輸": "火車：坐火車至豐原火車站下車，火車站出來左轉中正路，沿中正路一直走，步行大約3至5分鐘即可到達。 客運：坐到豐原火車站下車，若搭豐原客運，可直走三民路，接和平街到底，右轉中正路即可到達。",
    "旅遊叮嚀": "以三角圓（水晶餃）、排骨酥麵、鳳梨冰、菱角酥、蚵仔煎、肉粽、潤餅、肉圓、關東煮、雞蛋糕、涼圓、醃漬水果等最知名。",
    "景點ID": "947",
    "東經": "120.71913",
    "狀態": "開啟",
    "簡述": "豐原廟東復興商圈，亦稱廟東小吃街、廟東夜市、廟東商圈。位於臺中市豐原區慈濟宮旁，範圍包含中正路、博愛街、復興路、信義街。夜市發展歷史相當久遠，是許多學生的聚集熱點。附近的復興路商圈，也增加了三民路、復興路、和平街，範圍大約圍繞著豐原媽祖廟，為山線地區居民逛街之處。",
    "行車資訊": "國道1號→豐原交流道後→沿中正路直行→中正路與信義路交叉口即可見廟東小吃。",
    "門票資訊": "免費參觀",
    "tel": "04-25222106",
    "picture": "https://www.taichung.travel/Utility/DisplayImage?id=12761",
    "開放時間": "每日10:00-23:00",
    "官方網站": "https://travel.taichung.gov.tw/zh-tw/Attractions/Intro/947/%E5%BB%9F%E6%9D%B1%E5%A4%9C%E5%B8%82"
  },
  {
    "type": "歷史古蹟",
    "area": "豐原區",
    "介紹": "位於中正路與信義路交叉路口，慈濟宮是豐原地區民眾的信仰中心，主祀天上聖母-媽祖。創建於清雍正年間，迄今已有兩百多年歷史，初名為「觀音亭」，日治時期曾被充為學校，日治大正6年(西元1917年)在地方士紳張麗俊先生積極推動下修繕廟宇，奠定慈濟宮今貌的基礎。後經郭石來先生與多方人士努力下，於九二一大地震後再度以仿古修復，並完成慈濟大樓、文化大樓等工程。慈濟宮另設有圖書館、頌經團、慈明團等。正殿供奉媽祖，同祀神明為神農大帝、文昌帝君、觀音菩薩、地母娘娘、註生娘娘等。前慈濟宮主委曾表示：「引炷入爐，不如誠心向天；求神禱拜，毋寧修身自持」。信徒只要誠心向天，修身自持，雙手合十參拜也可。每年的媽祖聖誕前夕，慈濟宮會舉行祭典，場面莊嚴。媽祖聖誕(農歷3月23日)即有繞境活動，是每年一度的重要慶典。",
    "停車資訊": "",
    "北緯": "24.25167",
    "name": "豐原慈濟宮",
    "address": "台中市豐原區中正路179號",
    "大眾運輸": "由臺中火車站步行約134公尺，到達臺中火車站，搭乘55、6500、6501、6504、6506或6603路公車到達媽祖廟，再步行約 54 公尺到達慈濟宮。",
    "旅遊叮嚀": "",
    "景點ID": "809",
    "東經": "120.71901",
    "狀態": "開啟",
    "簡述": "豐原著名的廟東夜市，所指稱的廟宇即是「慈濟宮」，創建約為清朝年間，供奉天上聖母，為豐原地方居民的重要的信仰中心，建築為三殿兩戶龍式，座南朝北，廟前種植有老榕樹，並有一對由民間企業所捐獻的巨大的銅獅子，氣勢十足增添莊嚴。 　　 經過多次整修的慈濟宮，歷年來耗費不少心力維護，保留了珍貴的歷史文物，像是宮內的木雕、石雕工藝精細，皆出自名師名匠之手，石壁、石獅、龍柱、羅漢柱及彩繪等，細細觀察其生動神采，展現傳統文化的珍貴。",
    "行車資訊": "",
    "門票資訊": "免費參觀",
    "tel": "04-25223184",
    "picture": "https://www.taichung.travel/Utility/DisplayImage?id=237",
    "開放時間": "全天候開放",
    "官方網站": "http://www.zhujai.org.tw/"
  },
  {
    "type": "藝文走廊",
    "area": "豐原區",
    "介紹": "來到味噌釀造文化館，不藏私的，讓您可以了解到，味噌的文化、種類、食用的方式以及製作的方法。當您了解後，文化館目前也開放味噌DIY體驗活動，讓您可以親身體驗食品釀造的樂趣。另外，還有味噌料理DIY的解說，讓您可以輕輕鬆鬆在家烹調味噌料理。",
    "停車資訊": "",
    "北緯": "24.23423",
    "name": "台灣味噌釀造文化館",
    "address": "台中市豐原區西勢路701號",
    "大眾運輸": "",
    "旅遊叮嚀": "",
    "景點ID": "808",
    "東經": "120.7006",
    "狀態": "開啟",
    "簡述": "座落於臺中豐原的味榮食品創立至今即將邁入七十年。為了將釀造文化延續傳承，味榮成立了台灣第一座【味噌釀造文化館】，除了將釀造之精神文化於館內外建築物呈現外，館內也呈列著味榮製作味噌從無到有的歷程。",
    "行車資訊": "中山高速公路168km處豐原/神岡交流道下，往豐原方向，直走至天橋下(右轉)，豐原大道直走，遇TOYOTA修配廠(右轉)，直走約200公尺第二個紅綠燈(左轉)，即可到達。",
    "門票資訊": "免費參觀",
    "tel": "04-25320279",
    "picture": "https://travel.taichung.gov.tw/Utility/DisplayImage?id=269",
    "開放時間": "每日09:00-17:00",
    "官方網站": "https://www.facebook.com/TaiwanMisoCulturalMuseum/"
  },
  {
    "type": "娛樂景點",
    "area": "豐原區",
    "介紹": "國 80 年太平洋建設將經營觸角延伸，成立第一家太平洋百貨-豐原店。 秉持著『顧客至上，服務至上』的理念，期望與生活緊密結合。太平洋百貨以「微笑、活潑、敏捷」的服務精神，和全系列的商品，滿足豐原、神岡、東勢等地區民眾生活購物所需，也與週邊的廟東夜市和豐原車站商圈共築成豐原最熱鬧的美食、購物、娛樂商圈，落實了「地方共榮、回饋社會」的企業責任，繼續和社區共同發展，共謀進步。 ",
    "停車資訊": "",
    "北緯": "24.25102",
    "name": "豐原太平洋百貨",
    "address": "台中市豐原區復興路2號",
    "大眾運輸": "搭乘火車，至豐原火車站下車，往中正路方向步行約7~10分鐘。 免費接駁車服務，於週六、日、例假日期間10:30~22:30，特別設有免費購物接駁專車。",
    "旅遊叮嚀": "",
    "景點ID": "780",
    "東經": "120.72081",
    "狀態": "開啟",
    "簡述": "民國 80 年太平洋建設將經營觸角延伸，在豐原成立第一家太平洋百貨，滿足豐原、神岡、東勢等地區民眾生活購物所需。",
    "行車資訊": "中山高國道1號下豐原交流道，走省道10號神岡中山路接豐原中正路，至中正路、向陽路三叉路口右轉博愛街。",
    "門票資訊": "免費參觀",
    "tel": "04-25291111",
    "picture": "https://www.taichung.travel/Utility/DisplayImage?id=1829",
    "開放時間": "週一至週五 11:00-22:00，假日10:30-22:00",
    "官方網站": "https://fy.pacific-mall.com.tw/indexStore.php"
  },
  {
    "type": "藝文走廊",
    "area": "豐原區",
    "介紹": "漆藝館是臺灣首座公立的漆藝展覽館，臺灣的漆藝發展可溯源至日治時代，當時臺中市內由於有大雪山及八仙山兩座林場，提供漆器工藝所需的材料，加上日人在中部地 區有計劃的培植漆藝業，因此造就不少漆工人才，地利加上人和，促使臺中市漆器業的蓬勃發展。民國50年代左右，由美國出資日本提供設備和技術，在豐原設立「米爾帕赫羅工廠」，專事生產介於木器及漆器間的沙拉碗，之後許多漆器人才自行到外開業，到民國六、七十年代，本地漆器店已達40多家，此時也是外銷日本的黃金時期，大部分漆器均由豐原地區輸出，豐原遂成為臺灣漆藝的重鎮。時至今日，漆器工業已遂漸移至勞力密集的第三世界國家，豐原地區的漆藝工業盛況不再，因此漆藝館的設置代表的是漆藝創新與再生的火車頭，漆藝館設於風光優美的中正公園內，一樓為展示場和操作工作室，展出內容包括漆器工藝的史料和知名藝師的作品等。二樓主要為地方文化產業展覽室和研習教室，這也是館方為了支援傳承技藝教學研習活動的地方，所以漆藝館不僅是有靜態的展覽，更兼具教育、產業、文化、休閒等功能的知性空間。",
    "停車資訊": "1. 漆藝館後方停車場 2. 鎮清宮停車場 3. 中正公園停車場",
    "北緯": "24.25509",
    "name": "豐原漆藝館",
    "address": "台中市豐原區水源路1-1號",
    "大眾運輸": "1. 搭乘火車至豐原火車站下→至豐中路(火車站前警察局旁)上搭乘12號公車→於水源地站下車→沿水源路繼續向前步行50公尺 2. 搭乘火車至豐原火車站下→至豐原客運總站搭乘[222豐原－球場]或[223豐原－坪頂]公車→於中正公園站(或水源地站)下車→沿水源路向後步行50公尺 (沿水源路繼續向前步行50公尺)",
    "旅遊叮嚀": "",
    "景點ID": "488",
    "東經": "120.74579",
    "狀態": "開啟",
    "簡述": "臺灣漆藝的發展早在日治時期，臺中市內由於有大雪山和八仙山兩大林場，提供了漆器工藝所需的資材，加上日人在中部地區曾有計劃的拓展漆器事業，培訓了不少漆工人才，在各項條件成熟之下，促成了臺中市漆器業的蓬勃發展。 但自臺灣造林護林、禁止砍伐的政策實施之後，臺產的木材短缺，漆器製作所需胎體改用進口木材，且漆器產業的生產非常耗費時間與勞力。民國七十七年後，臺灣經濟環境大變動，漆器產業經營面臨極大的困難，臺灣漆器產業也就日漸蕭條。 作為「臺灣漆藝產業故鄉」，今日的豐原葫蘆墩依然具備發展地方特色「漆器」工藝的歷史價值和自",
    "行車資訊": "⊙國道4號→右轉豐勢路→左轉富陽路→左轉水源路50公尺直行 ⊙中正路→左轉圓環西路→圓環北路→圓環東路→水源路 ⊙中正路→過鐵路地下道→左轉豐陽路→接水源路直行",
    "門票資訊": "免費參觀",
    "tel": "04-25130177",
    "picture": "https://travel.taichung.gov.tw/Utility/DisplayImage?id=28095",
    "開放時間": "週二至週六 09:00-17:00",
    "官方網站": "https://fy.pacific-mall.com.tw/indexStore.php"
  },
  {
    "type": "藝文走廊",
    "area": "豐原區",
    "介紹": "「編織」是世界共通的手工技藝，其所包涵的編、結、染、織、繡，除提供日常的衣食住行外，更豐富了生活的色彩，直到今天，依然貼身的陪著人們從迎接生命到終老，從實際的需求到創意的表現。本館以藺草編織、泰雅編織為起點，延伸至臺灣精緻優良的編織技藝（編、織、結、染、繡）與文化特色為主，並擴及至其它文化區的比較與觀摩，是一座以延續台灣傳統、發展現代編織工藝為主題的小型地方館。 ",
    "停車資訊": "",
    "北緯": "24.25281",
    "name": "葫蘆墩文化中心編織工藝館",
    "address": "台中市豐原區圓環東路782號",
    "大眾運輸": "豐原火車站下車，出站後直走至對面，步行約100餘公尺到達『豐原客運豐原總站』，搭乘(往東勢.谷關.卓蘭方向) 即可到達『文化中心站』 208路 豐原－卓蘭（豐原客運） * 206路 豐原－東勢南站（豐原客運） * 207路 豐原－谷關（豐原客運） * 209路 豐原－東勢林場（豐原客運） * 91路 舊庄－中興嶺（豐原客運） * 235路 豐原圓環線 * 新市政中心－陽明大樓（中台灣客運） 高鐵台中高鐵站步行約300公尺到達『高鐵臺中站(站牌)』，下至一樓搭乘台鐵新烏日至豐原的火車，",
    "旅遊叮嚀": "",
    "景點ID": "487",
    "東經": "120.73019",
    "狀態": "開啟",
    "簡述": "「編織」是世界共通的手工技藝，其所包涵的編、結、染、織、繡，除提供日常的衣食住行外，更豐富了生活的色彩，直到今天，依然貼身的陪著人們從迎接生命到終老，從實際的需求到創意的表現。",
    "行車資訊": "國道1號 ‧下【豐原交流道】往豐原方向→行駛中正路經圓環西路，或圓環南路，即可到達本中心。 ‧下【豐原交流道】往豐原方向→行駛中正路經向陽路→左轉圓環東路，即可到達本中心。 國道3號 ‧南下 於【中港系統交流道】接【國道4號(神岡、清水)】往神岡方向→於【臺中系統交流道】接【國道1號(后里、臺中)】往臺中方向→下【豐原交流道】往豐原方向→行駛中正路經圓環西路或圓環南路，即可到達本中心。 或下【豐原交流道】往豐原方向→行駛中正路經向陽路交叉路口→左轉圓環東路，即可到達本中心。 ‧北上 於【快官交流道】接【中",
    "門票資訊": "免費參觀",
    "tel": "04-25260136",
    "picture": "https://travel.taichung.gov.tw/Utility/DisplayImage?id=19391",
    "開放時間": "週二至週六 09:00-17:30",
    "官方網站": "https://www.huludun.taichung.gov.tw/form/index.asp?Parser=2,7,152,137"
  },
  {
    "type": "娛樂景點",
    "area": "豐原區",
    "介紹": "公老坪觀光果園育樂中心，是全國第一家創辦的觀光果園，也是交通部觀光局規劃台三線、旅遊據點，最具特色的果園之一。公老坪農場創設於民國六十六年，當時園主陸昌鼎先生為提供更自然的休閒空間，特別將農園規劃為休閒渡假、親自採果、新鮮品嚐、交誼開會、工商訓練、農村生態等多元性活動設計為宗旨。",
    "停車資訊": "",
    "北緯": "24.26247",
    "name": "公老坪會館農場",
    "address": "台中市豐原區水源路坪頂巷12 之1號",
    "大眾運輸": "豐原客運市內車2號崎頭站下車。",
    "旅遊叮嚀": "",
    "景點ID": "344",
    "東經": "120.7617",
    "狀態": "開啟",
    "簡述": "公老坪觀光果園育樂中心，是全國第一家創辦的觀光果園，也是交通部觀光局規劃台三線、旅遊據點，最具特色的果園之一。公老坪農場創設於民國六十六年，當時園主陸昌鼎先生為提供更自然的休閒空間，特別將農園規劃為休閒渡假、親自採果、新鮮品嚐、交誼開會、工商訓練、農村生態等多元性活動設計為宗旨。",
    "行車資訊": "高速公路下豐原交流道延中正路直走，與豐勢路一段交叉口左轉豐勢路，行約1.5公里遇水源路右轉，延水源路直行接坪頂巷過公老坪觀光果園約300公尺即可見豐源綜合觀光果園。離交流道約8公里。",
    "門票資訊": "免費參觀",
    "tel": "04-25245907",
    "picture": "http://www.g-l-plain.com.tw/sys/ieb/pic/m00801_1b.jpg",
    "開放時間": "週五至週日 16:00-22:00",
    "官方網站": "http://www.gorop.com.tw/"
  },
  {
    "type": "娛樂景點",
    "area": "豐原區",
    "介紹": "「后豐鐵馬道」路段由原來的臺鐵舊山線整建，沿途景觀多樣化，除了青翠田園與寧靜的鄉村景緻外，還有雄偉壯觀的花樑鋼橋，横跨在大甲溪寬廣的溪谷上。沿途景色絕佳，以及特殊的隧道穿越經驗，一個接一個的景觀盛宴，讓這趟悠閒的單車之旅，既豐富又令人驚豔。自行車道也與12餘公里的「東豐自行車綠廊」相接，形成總長18公里的自行車道，各路段有不同的風景特色，相信足以讓民眾充分享受乘騎自行車的樂趣。 東豐鐵路綠色走廊是全國第一條由廢棄鐵道改建而成的自行車專用道，也是國內唯一封閉型的自行車專用道，沿途風光明媚、景色宜人，田園、樹蔭相伴，沒有車輛干擾，充滿了踩踏單車的樂趣，騎上單車，綠色的大甲溪等著你去體驗。",
    "停車資訊": "適合開車，附近停車位多。",
    "北緯": "24.27169",
    "name": "后豐鐵馬道",
    "address": "豐原國道四號線高架橋下",
    "大眾運輸": "火車：搭乘火車到后里站下車，改搭乘往豐原的豐原客運，在后里馬場下車。 公車：可於台中火車站前、豐原火車站、統聯豐原站搭乘豐原客運，往大甲班車，可於「后里馬場」下車即可。",
    "旅遊叮嚀": "1. 建議夏日攜帶傘、帽，注意防曬，冬季攜帶防風外套。 2. 自行車道起點、終點皆有自行車出租。",
    "景點ID": "89",
    "東經": "120.74037",
    "狀態": "開啟",
    "簡述": "「后豐鐵馬道」於94年4月17日開通啟用，起點位於豐原區國道4號線高架橋下方，終點至后里馬場，貫穿原舊山線「9號隧道」，再經花樑鋼橋，全長4.5公里。自行車道也與「東豐自行車綠廊」相接，形成總長18公里，具獨特懷舊魅力的自行車專用道。",
    "行車資訊": "由國道1或3號接國道4號，由豐原交流道下左轉，沿臺13線至馬場路(寺山路)右轉直行至后里馬場前即可到達。 由國道1或3號接國道4號，由豐原東勢交流道下廻轉，沿國道4號橋下約50公尺可到達。",
    "門票資訊": "免費參觀",
    "tel": "04-25724511",
    "picture": "https://travel.taichung.gov.tw/Utility/DisplayImage?id=216",
    "開放時間": "全天候開放",
    "官方網站": "http://2horse.mmmtravel.com.tw/"
  },
  {
    "type": "藝文走廊",
    "area": "豐原區",
    "介紹": "位於豐原區圓環東路上，文藝氣息濃厚，是台中市民的文化、休閒重鎮。文化中心內保存、維護了許多重要地方。成立以來，發揮地方特色，宣揚鄉土文化，倡導讀書風氣，建立書香社會，辦理藝文活動，提高民眾欣賞水準，舉辦假日表演廣場活動，提供民眾正當休閒活動，建立志工制度，擴大參與層面，辦理藝文研習活動，培育藝文人口。79年設置編織工藝館，致力於保存及研究編織技藝，策辦編織展覽，獎勵並培育編織人才，每二年辦理一屆全國性的編織工藝獎，辦理國際交流活動，策辦「亞太編織藝術節」、「臺灣vs沖繩」、「日本和服捐贈展」等，累積文化外交的能力與經驗。99年12月25日臺中市市合併升格直轄市，中心改制，並依據所在地豐原舊地名，定名為「葫蘆墩文化中心」，直屬臺中市政府文化局所轄，為大臺中地區山線最重要的文化機構。",
    "停車資訊": "本中心（文化中心(平面)停車場：於文化中心裡面，共69個停車格）。 中心右側北陽(平面)停車場：共208格，每小時20元。",
    "北緯": "24.25281",
    "name": "葫蘆墩文化中心",
    "address": "台中市豐原區圓環東路782 號",
    "大眾運輸": "豐原火車站下車，出站後直走至對面，步行約100餘公尺到達『豐原客運豐原總站』，搭乘(往東勢.谷關.卓蘭方向) 即可到達『文化中心站』。 * 208路 豐原－卓蘭（豐原客運） * 206路 豐原－東勢南站（豐原客運） * 207路 豐原－谷關（豐原客運） * 209路 豐原－東勢林場（豐原客運） * 91路 舊庄－中興嶺（豐原客運） * 235路 豐原圓環線 * 新市政中心－陽明大樓（中台灣客運）",
    "旅遊叮嚀": "",
    "景點ID": "81",
    "東經": "120.73019",
    "狀態": "開啟",
    "簡述": "位於豐原區圓環東路上，文藝氣息濃厚，是台中市民的文化、休閒重鎮。文化中心內保存、維護了許多重要地方文化資產。並按年度排定各項文物展覽，且設有預約導覽，進行展品之介紹解說，以發揮文化中心與民眾之間的互動及社教功能。近年來亦經常舉辦各式各樣有趣的文化活動。",
    "行車資訊": "*國道1號 ‧下【豐原交流道】往豐原方向→行駛中正路經圓環西路，或圓環南路，即可到達本中心。 ‧下【豐原交流道】往豐原方向→行駛中正路經向陽路→左轉圓環東路，即可到達本中心。 *國道3號 ‧南下 於【中港系統交流道】接【國道4號(神岡、清水)】往神岡方向→於【臺中系統交流道】接【國道1號(后里、臺中)】往臺中方向→下【豐原交流道】往豐原方向→行駛中正路經圓環西路或圓環南路，即可到達本中心。 或下【豐原交流道】往豐原方向→行駛中正路經向陽路交叉路口→左轉圓環東路，即可到達本中心。 ‧北上 於【快官交流道】接",
    "門票資訊": "免費參觀",
    "tel": "04-25260136",
    "picture": "https://travel.taichung.gov.tw/Utility/DisplayImage?id=19388",
    "開放時間": "週二至週六 08:30-21:00，周日08:30-17:00",
    "官方網站": "https://www.huludun.taichung.gov.tw/"
  }
]


//DOM
const mainTitle = document.querySelector('.main-title');
const mainContent = document.querySelector('.main-content');
const btn = document.querySelectorAll('#btn-lsit');
const btnLink = document.querySelector('#btn-link')

//event
for (let i = 0; i < btn.length; i++) {
  btn[i].addEventListener('click', getData, false)
}

btnLink.addEventListener('click', goNews, false)

function getData(e) {
  let select = e.target.value;
  let array = [];
  let str = '';

  if (select === '漫遊豐原') {
    str = `
    <div class="col col-sm-10 m-auto">
      <p>豐原舊名為「葫蘆墩」今為臺中市之所在地，總面積為41.1845平方公里。葫蘆墩地名的由來，據史料所載：豐原附近一帶地區，在康熙年間，猶為原始景觀，草萊遍野松柏叢生，先住民稱之「泰耶爾墩」，即為松柏林之意。</p>
      <p>一說「葫蘆墩」係為土著族「泰耶爾墩」之譯音而來，或以本區舊有「墩腳」與下南，坑有三小丘，形如葫蘆，故取其名。</p>
      <p>康熙23年（西元1684年），置台灣為一府三縣，本區隸屬諸羅縣。清雍正11年（西元1733年），張達京著手開墾土地興鑿水圳，始由中國廣東引進許多移民來此，從此漢人在此落腳。</p>
      <p>光緒12年（西元1886年）葫蘆墩設巡撿衙門，豐原置官始於此；嗣而復將束東上堡保甲局（聯保局）移駐葫蘆墩街，因之岸裡大社之繁華，取而代之。</p>
      <p>巡撫劉銘傳來台，看見豐原土地肥沃物產富饒，命名為〔富春鄉〕，由於豐原水質佳、又出美女，於是便有〔小蘇州〕之稱。當時豐原改由台灣縣管轄。</p>
      <p>以開發而言，豐原係為岸裡社之延伸，當時，為原住民平埔族「拍宰海」（Pazeh或Pazzehe）族群所盤据，轄內有葫蘆墩（Fuluton）、崎仔腳（一作岐仔下）、烏牛欄（Auran）、翁仔（Barlaeon）、樸仔籬（Poaly或作Abouan Poaly）諸小社，以麻薯屯為為酋長，俱為「岸裡社」（Raho Dopuru）所屬。</p>
      <p>日本治台後，將原本的台灣縣改為臺中市，後將今日的豐原、潭子、大雅、神岡、社口等地合併為〔豐原郡〕，開始有豐原之名。</p>
      <p>民國39年10月21日台中縣設立，豐原成為縣治所在地，民國65年因人口漸增升格為縣轄市，民國99年12月25日台中縣市合併升格為直轄市，豐原改為臺中市豐原區迄今。</p>
    </div>
    <div class="col col-sm-10 m-auto">
      <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d58204.10875072422!2d120.70024463719606!3d24.25028350079824!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x34691a3d81132aa9%3A0xf0101d452f6d9c9f!2zNDIw5Y-w5Lit5biC6LGQ5Y6f5Y2A!5e0!3m2!1szh-TW!2stw!4v1563852244296!5m2!1szh-TW!2stw" width="100%" height="450" frameborder="0" style="border:0" allowfullscreen></iframe>
  </div>
    `
  } else {
    //篩選資料
    for (i = 0; i < data.length; i++) {
      if (select === data[i].type) {
        array.push({
          id: data[i]["景點ID"],
          type: data[i].type,
          name: data[i].name,
          descrip: data[i]["介紹"],
          address: data[i].address,
          ticket: data[i]["門票資訊"],
          time: data[i]["開放時間"],
          picture: data[i].picture,
          tel: data[i].tel,
          link: data[i]["官方網站"]
        })
      }
    }
    console.log(array);
    //組字串
    for (i = 0; i < array.length; i++) {

      str += `
      <div class="col-md-6 mb-5">
        <div class="card">
          <div class="img bg-cover"
            style="height: 200px; background: url(${array[i].picture}) center center">
            <div class="container h-100">
              <div class="row h-100 align-items-end justify-content-end">
                <div class="col col-md-8">
                  <h5 class="text-light h2 font-weight-bolder">${array[i].name}</h5>
                </div>
                <div class="col col-md-4">
                  <p class="text-light text-right h6">${array[i].type}</p>
                </div>
              </div>
            </div>
          </div>
          <div class="card-body">
            <p class="pl-4" style="background: url(images/icons_clock.png) 0 0 no-repeat">${array[i].time}</p>
            <p class="pl-4" style="background: url(images/icons_pin.png) 0 0 no-repeat">${array[i].address}</p>
            <p class="pl-4" style="background: url(images/icons_phone.png) 0 0 no-repeat">${array[i].tel}</p>
            <div class="d-flex align-items-start">
              <p class="pl-4 mr-auto" style="background: url(images/icons_tag.png) 0 0 no-repeat">${array[i].ticket}</p>
              <!-- Button trigger modal -->
              <button type="button" class="btn btn-outline-info btn-sm" data-toggle="modal" data-target="#card-modal${i}">
                了解更多
              </button>
            </div>
          </div>
        </div>
      </div>

      <!-- Modal -->
      <div class="modal fade" id="card-modal${i}" tabindex="-1" role="dialog" aria-labelledby="exampleModalCenterTitle"
        aria-hidden="true">
        <div class="modal-dialog modal-lg modal-dialog-centered" role="document">
          <div class="modal-content">
            <div class="modal-header">
              <h5 class="modal-title" id="exampleModalCenterTitle">${array[i].name}</h5>
              <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                <span aria-hidden="true">&times;</span>
              </button>
            </div>
            <div class="modal-body">
              <div class="container-fluid">
                <div class="row">
                  <div class="col-md-6 mb-2 bg-cover"
                    style="min-height: 280px; background: url(${array[i].picture}) center center">
                  </div>
                  <div class="col-md-6">${array[i].descrip}</div>
                </div>
              </div>

            </div>
            <div class="modal-footer">
              <button type="button" class="btn btn-secondary" data-dismiss="modal">關閉</button>
              <a href="${array[i].link}" target="blink" class="btn btn-info">瀏覽官網</a>
            </div>
          </div>
        </div>
      </div>
      `
    }
  }

  //view
  mainTitle.innerHTML = select
  mainContent.innerHTML = str;
}


function goNews() {
  mainTitle.innerHTML = '地方記事'
  mainContent.innerHTML = `
    <div class="col">
    <iframe name="main" width="100%" height="650" marginwidth="0" marginheight="0" scrolling="no" frameborder="0"></iframe>
    </div>
  `
  
}


function init() {
  // initialisation stuff here
  mainTitle.innerHTML = btn[0].value;
  mainContent.innerHTML = `
  <div class="col col-sm-10 m-auto">
    <p>豐原舊名為「葫蘆墩」今為臺中市之所在地，總面積為41.1845平方公里。葫蘆墩地名的由來，據史料所載：豐原附近一帶地區，在康熙年間，猶為原始景觀，草萊遍野松柏叢生，先住民稱之「泰耶爾墩」，即為松柏林之意。</p>
    <p>一說「葫蘆墩」係為土著族「泰耶爾墩」之譯音而來，或以本區舊有「墩腳」與下南，坑有三小丘，形如葫蘆，故取其名。</p>
    <p>康熙23年（西元1684年），置台灣為一府三縣，本區隸屬諸羅縣。清雍正11年（西元1733年），張達京著手開墾土地興鑿水圳，始由中國廣東引進許多移民來此，從此漢人在此落腳。</p>
    <p>光緒12年（西元1886年）葫蘆墩設巡撿衙門，豐原置官始於此；嗣而復將束東上堡保甲局（聯保局）移駐葫蘆墩街，因之岸裡大社之繁華，取而代之。</p>
    <p>巡撫劉銘傳來台，看見豐原土地肥沃物產富饒，命名為〔富春鄉〕，由於豐原水質佳、又出美女，於是便有〔小蘇州〕之稱。當時豐原改由台灣縣管轄。</p>
    <p>以開發而言，豐原係為岸裡社之延伸，當時，為原住民平埔族「拍宰海」（Pazeh或Pazzehe）族群所盤据，轄內有葫蘆墩（Fuluton）、崎仔腳（一作岐仔下）、烏牛欄（Auran）、翁仔（Barlaeon）、樸仔籬（Poaly或作Abouan Poaly）諸小社，以麻薯屯為為酋長，俱為「岸裡社」（Raho Dopuru）所屬。</p>
    <p>日本治台後，將原本的台灣縣改為臺中市，後將今日的豐原、潭子、大雅、神岡、社口等地合併為〔豐原郡〕，開始有豐原之名。</p>
    <p>民國39年10月21日台中縣設立，豐原成為縣治所在地，民國65年因人口漸增升格為縣轄市，民國99年12月25日台中縣市合併升格為直轄市，豐原改為臺中市豐原區迄今。</p>
  </div>
  <div class="col col-sm-10 m-auto">
    <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d58204.10875072422!2d120.70024463719606!3d24.25028350079824!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x34691a3d81132aa9%3A0xf0101d452f6d9c9f!2zNDIw5Y-w5Lit5biC6LGQ5Y6f5Y2A!5e0!3m2!1szh-TW!2stw!4v1563852244296!5m2!1szh-TW!2stw" width="100%" height="450" frameborder="0" style="border:0" allowfullscreen></iframe>
  </div>
`
}

// elsewhere in code 
window.load = init(); 